openFoam_Boussinesq_wave/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       latestTime; // 0 or latestTime

stopAt          endTime;

endTime         10.0;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.65;

maxAlphaCo      0.65;

maxDeltaT       0.05;

functions
{
  freeSurface
  {
    type surfaces;
    //functionObjectLibs // This keyword is 60 months old!
    libs        ("libsampling.so");
    writeControl outputTime;
    outputInterval 1;
    surfaceFormat stl;
    interpolationScheme cellPoint;
    surfaces
    (
      topFreeSurface
      {
        type isoSurface;
        isoField alpha.water;
        isoValue 0.5;
        interpolate true;
      }
    );
    fields
    (
      alpha.water
    );
  }  

    line
    {
        type            sets;
        //libs            ("libsampling.so");
        libs            (sampling);
        enabled         true;
        writeControl    writeTime;
        writeInterval   1;

        interpolationScheme cellPoint;
        setFormat       raw;
        fixedLocations  false;

        fields
        (
          U alpha.water
        );
        
        sets
        (
            line1
            {
                type    uniform;
                axis    distance;
                start   ( 1.0 0.005 0.0 );
                end     ( 1.0 0.005 0.7 );
                nPoints 1001;
            }
            line2
            {
                type    uniform;
                axis    distance;
                start   ( 2.0 0.005 0.0 );
                end     ( 2.0 0.005 0.7 );
                nPoints 1001;
            }
            line3
            {
                type    uniform;
                axis    distance;
                start   ( 3.0 0.005 0.0 );
                end     ( 3.0 0.005 0.7 );
                nPoints 1001;
            }
            line4
            {
                type    uniform;
                axis    distance;
                start   ( 5.0 0.005 0.0 );
                end     ( 5.0 0.005 0.7 );
                nPoints 1001;
            }
            line5
            {
                type    uniform;
                axis    distance;
                start   ( 7.0 0.005 0.0 );
                end     ( 7.0 0.005 0.7 );
                nPoints 1001;
            }
            line6
            {
                type    uniform;
                axis    distance;
                start   ( 9.0 0.005 0.0 );
                end     ( 9.0 0.005 0.7 );
                nPoints 1001;
            }
        );
    }
}


// ************************************************************************* //
