openFoam_Boussinesq_wave/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0.0 0.0 0.0)
    ( 10.0 0.0 0.0)
    ( 10.0 0.01 0.0)
    ( 0.0 0.01 0.0)
    ( 0.0 0.0 1.0)
    ( 10.0 0.0 1.0)
    ( 10.0 0.01 1.0)
    ( 0.0 0.01 1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (2000 1 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  inlet
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }

  outlet
  {
    type patch;
    faces
    (
      (1 5 6 2)
    );
  }

  ground
  {
    type wall;
    faces
    (
      (0 1 2 3)
    );
  }

  top
  {
    type patch;
    faces
    (
      (4 5 6 7)
    );
  }

  side1
  {
    type patch; //empty;
    faces
    (
      (0 1 5 4)
    );
  }

  side2
  {
    type patch; //empty;
    faces
    (
      (3 2 6 7)
    );
  }
);

mergePatchPairs
(
);


// ************************************************************************* //
