openFoam_Boussinesq_wave/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   patch;
sourceCase      ".";
sourcePatches   (side1);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName side2;

// Flip surface normals before usage.
flipNormals     true;

// Linear extrusion in point-normal direction
extrudeModel    linearNormal;

nLayers             1;
expansionRatio      1.0;

linearNormalCoeffs
{
    //direction       (1 -0.2 -0.03);
    thickness       0.02;
}

mergeFaces      false;


// ************************************************************************* //
