openFoam_Boussinesq_wave/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          201;
        startFace       618775;
    }
    outlet
    {
        type            patch;
        nFaces          102;
        startFace       618976;
    }
    top
    {
        type            patch;
        nFaces          2000;
        startFace       619078;
    }
    side1
    {
        type            patch;
        nFaces          310488;
        startFace       621078;
    }
    side2
    {
        type            patch;
        nFaces          310488;
        startFace       931566;
    }
    ramp
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       1242054;
    }
)

// ************************************************************************* //
