openFoam_Boussinesq_wave/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

// ORIGINAL OUTLET
//    outlet
//    {
//        type            waveVelocity;
//        value           uniform (0 0 0);
//    }

// OUTLET AFTER EXTRUDING MESH
    outlet
    {
      type noSlip;
    }

    side1
    {
        type            slip; //empty;
    }

    side2
    {
        type            slip; //empty;
    }
    
//    ground
//    {
//        type            fixedValue;
//        value           uniform (0 0 0);
//    }

// AFTER EXTRUDING
    ramp
    {
      type fixedValue;
      value uniform (0 0 0);
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
