openFoam_Boussinesq_wave/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0005094;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
      type zeroGradient;
    }

    side1
    {
        type            slip; //empty;
    }

    side2
    {
        type            slip; //empty;
    }

    ramp
    {
      type              epsilonWallFunction;
      value             uniform 0.0005094;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 0.0005094;
        value           uniform 0.0005094;
    }
}


// ************************************************************************* //
