openFoam_Boussinesq_wave/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
      type            calculated;
      value           uniform 0; 
    }

    side1
    {
        type            calculated; //empty;
        value           uniform 0;
    }

    side2
    {
        type            calculated; //empty;
        value           uniform 0;
    }

    ramp
    {
      type              nutkWallFunction;
      value             uniform 0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
