openFoam_Boussinesq_wave/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication snappyHexMesh

runApplication extrudeMesh

runApplication decomposePar

runParallel setFields

runParallel $(getApplication)

#------------------------------------------------------------------------------
